---
kind: property
id: P:Autodesk.Revit.DB.Lighting.BasicLossFactor.LossFactor
source: html/88f2e133-fe80-f35a-4e8f-e9c0870f5448.htm
---
# Autodesk.Revit.DB.Lighting.BasicLossFactor.LossFactor Property

The loss factor.

## Syntax (C#)
```csharp
public double LossFactor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The loss factor is not valid because it is not between 0.0 and 4.0.